000101210203**FREE
000102210203// COMAND TO CODE FREE FROM POSITION **FREE
000103210203// OTHERWISE, JUST START CODE ON COLUMN 7
000104210203
000105210210      DCL-F COVIDDSP  WORKSTN; // INCLUDE FILE COVIDDSP
000106210210      DCL-F COVIDINFO WORKSTN;
000107210203
000108210203      EXSR CLEAR;       // INITIALIZE INDICATORS AND FIELDS -SUBROTINE CLEAR
000109210203      EXFMT RISKFACTOR; // EXECUTE FIRST FORM
000110210203
000111210203      // LOOP WHILE PROGRAM IS RUNNING (NOT PRESSED F03 - EXIT)
000112210203      DOW NOT(*IN03); // DOW (*IN03=*OFF) // DOW *IN03
000113210203          IF GENDER = '';
000114210203             *IN95 = *ON;
000115210203             EXFMT RISKFACTOR;
000116210203             *IN95 = *OFF;
000117210203             ITER;
000118210203          ELSEIF CVDISEASE = '';
000119210203             *IN96 = *ON;
000120210203             EXFMT RISKFACTOR;
000121210203             *IN96 = *OFF;
000122210203             ITER;
000123210203          ELSEIF DIABETES = '';
000124210203             *IN97 = *ON;
000125210203             EXFMT RISKFACTOR;
000126210203             *IN97 = *OFF;
000127210203             ITER;
000128210203          ELSEIF RSPDISEASE = '';
000129210203             *IN98 = *ON;
000130210203             EXFMT RISKFACTOR;
000131210203             *IN98 = *OFF;
000132210203             ITER;
000133210203          ELSEIF HBPRESSURE = '';
000134210203             *IN99 = *ON;
000135210203             EXFMT RISKFACTOR;
000136210203             *IN99 = *OFF;
000137210203             ITER;
000138210203          ELSE;
000139210203             EXSR DETERMINERISK;
000140210203             TOTALQ = TOTALQ + 1;
000141210203             *IN60 = *ON;
000142210203             WRITE RISKFACTOR;
000143210203             EXFMT RISKASSMNT;
000144210203             *IN60 = *OFF;
000145210203          ENDIF;
000146210203
000147210210          IF *IN01=*ON;
000148210210             EXSR COHRECOMEN;
000149210210          ENDIF;
000150210210
000151210203          IF *IN03=*OFF;
000152210203                 EXSR CLEAR;
000153210203                 EXFMT RISKFACTOR; // EXECUTE SECOND FORM
000154210203          ENDIF;
000155210203      ENDDO;
000156210203
000157210203      *INLR = *ON;
000158210203      RETURN; // END PROGRAM
000159210203
000160210203      // CLEAR SUBROTINE
000161210203      BEGSR CLEAR;
000162210203         // CLEAR INDICATORS
000163210203         *IN95 = *OFF;
000164210203         *IN96 = *OFF;
000165210203         *IN97 = *OFF;
000166210203         *IN98 = *OFF;
000167210203         *IN99 = *OFF;
000168210203         // CLEAR FIELDS
000169210203         GENDER = '';
000170210203         CVDISEASE = '';
000171210203         DIABETES = '';
000172210203         RSPDISEASE = '';
000173210203         HBPRESSURE = '';
000174210210         BIRTHDATE = %DATE();
000175210203      ENDSR;
000176210203
000177210203      // DETERMINERISK SUBROTINE
000178210203      BEGSR DETERMINERISK;
000181210210         // CALCULATE AGE
000182210210         AGE = %DIFF(%DATE():BIRTHDATE:*Y);
000183210210
000184210210         EXSR AGEFACTOR;
000185210210         EXSR OTHERFACTORS;
000186210210
000187210210         // EVALUATE FRATE TO DETERMINE COHORT
000188210210         SELECT;
000189210210           WHEN FRATE >= 9.5;
000190210210                COHORT = 'Group 1';
000191210210           WHEN FRATE >= 5.5;
000192210210                COHORT = 'Group 2';
000193210210           WHEN FRATE >= 3.5;
000194210210                COHORT = 'Group 3';
000195210210           WHEN FRATE >= 1.5;
000196210210                COHORT = 'Group 4';
000197210210           OTHER;
000198210210                COHORT = 'Group 5';
000199210210         ENDSL;
000201210203      ENDSR;
000202210210
000203210210      // AGE FACTOR SUBROUTINE: DETERMINE THE FATALITY RATES BASED ON AGE
000204210210      BEGSR AGEFACTOR;
000205210210         // EVALUATE AGE FACTOR
000206210210         SELECT;
000207210210           WHEN AGE >= 80;
000208210210                FRATE = 14.800;
000209210210           WHEN AGE >= 70;
000210210210                FRATE = 08.000;
000211210210           WHEN AGE >= 60;
000212210210                FRATE = 03.600;
000213210210           WHEN AGE >= 50;
000214210210                FRATE = 01.300;
000215210210           WHEN AGE >= 40;
000216210210                FRATE = 00.400;
000217210210           WHEN AGE >= 30;
000218210210                FRATE = 00.250;
000219210210           WHEN AGE >= 20;
000220210210                FRATE = 00.230;
000221210210           WHEN AGE >= 10;
000222210210                FRATE = 00.200;
000223210210           OTHER;
000224210210                FRATE = 0.100;
000225210210         ENDSL;
000226210210      ENDSR;
000227210210
000228210210      // OTHER FACTORS SUBROUTINE: DETERMINE MODIFIERS THAT INCREASE FATALITY RATE
000229210210      BEGSR OTHERFACTORS;
000230210210         // Cardiovascular Disease
000231210210         IF CVDISEASE = 'Y';
000232210210            FRATE = FRATE + 00.800;
000233210210         ENDIF;
000234210210
000235210210         // Diabetes
000236210210         IF DIABETES = 'Y';
000237210210            FRATE = FRATE + 00.600;
000238210210         ENDIF;
000239210210
000240210210         // High Blood Pressure
000241210210         IF HBPRESSURE = 'Y';
000242210210            FRATE = FRATE + 00.300;
000243210210         ENDIF;
000244210210
000245210210         // Respiratory Disease
000246210210         IF RSPDISEASE = 'Y';
000247210210            FRATE = FRATE + 00.400;
000248210210         ENDIF;
000249210210
000250210210         // GENDER Female
000251210210         IF GENDER  = 'F';
000252210210            FRATE = FRATE - 00.050;
000253210210         ENDIF;
000254210210      ENDSR;
000255210210
000256210210      // EXECUTE COHORT RECOMENDATIONS PROGRAM
000257210210      BEGSR COHRECOMEN;
000259210210         EXFMT CINFO;
000260210210      ENDSR;
