000100210215             PGM
000101210215             CALL       STRJOB
000102210308             ADDLIBLE   BCI433LIB
000103210323             ADDLIBLE   SENECAPAY
000104210323             ADDLIBLE   DWUE06
000105210215             MONMSG     CPF2103
000106210215
000107210215             DSPSYSLVL  *DISPLAY
000108210215             ENDPGM
000109210215
